recipes/white-sauce-pasta-bake.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>White sauce pasta bake</title>
<meta name="author" content="James" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content" class="content">
<h1 class="title">White sauce pasta bake</h1>
<p>
<a href="https://lovingitvegan.com/vegan-pasta-bake/#recipe">Original link</a>
</p>
<div id="outline-container-orga296dec" class="outline-2">
<h2 id="orga296dec">Ingredients</h2>
<div class="outline-text-2" id="text-orga296dec">
</div>
<div id="outline-container-org0db4205" class="outline-3">
<h3 id="org0db4205">Pasta</h3>
<div class="outline-text-3" id="text-org0db4205">
<ul class="org-ul">
<li>450g Penne Pasta (dry weight)</li>
</ul>
</div>
</div>
<div id="outline-container-org09f7dd4" class="outline-3">
<h3 id="org09f7dd4">For the Bolognese Sauce:</h3>
<div class="outline-text-3" id="text-org09f7dd4">
<ul class="org-ul">
<li>1 Medium Onion White, Yellow or Brown, Chopped</li>
<li>1 teaspoon Crushed Garlic</li>
<li>1 Tablespoon Olive Oil</li>
<li>5 cups White Button Mushrooms (480g) Sliced</li>
<li>1 Tablespoon Soy Sauce</li>
<li>1/2 cup Tomato Paste (130g)</li>
<li>1 can Brown Lentils (400mL) or 1.5 cups cooked brown lentils</li>
<li>2 cans Canned Chopped Tomato (800g)</li>
<li>1-2 Tablespoons Light Brown Sugar</li>
<li>Salt and Pepper to taste</li>
</ul>
</div>
</div>
<div id="outline-container-org75df565" class="outline-3">
<h3 id="org75df565">Cashew Cream</h3>
<div class="outline-text-3" id="text-org75df565">
<ul class="org-ul">
<li>1 cup Raw Cashews (150g)</li>
<li>1 Tablespoon Lemon Juice</li>
<li>1/2 cup Water (120mL)</li>
<li>1/2 teaspoon Salt</li>
</ul>
</div>
</div>
<div id="outline-container-orgf77d1e1" class="outline-3">
<h3 id="orgf77d1e1">White Sauce</h3>
<div class="outline-text-3" id="text-orgf77d1e1">
<ul class="org-ul">
<li>3 Tablespoons Vegan Butter</li>
<li>2 Tablespoons All Purpose Flour</li>
<li>1 can Coconut Milk (400mL) Full Fat, Canned, Unsweetened</li>
<li>1/3 cup Vegetable Stock (80mL) or Broth</li>
<li>1 teaspoon Black Pepper</li>
<li>1 teaspoon Dijon Mustard</li>
<li>1/4 cup Nutritional Yeast (15g)</li>
<li>Sea Salt to taste</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org7ccfda8" class="outline-2">
<h2 id="org7ccfda8">Instructions</h2>
<div class="outline-text-2" id="text-org7ccfda8">
<ol class="org-ol">
<li>Put the pasta on to cook while you prepare the vegetables for the bolognese sauce. When the pasta is cooked, drain it, cover it (to prevent it from drying out) and set aside.</li>
<li>Prepare your bolognese sauce. Add the onion and garlic to a pot with the olive oil and fry until softened. Then add in the sliced mushrooms and soy sauce. Cover the pot for a minute and allow the mushrooms to release their water. Then remove the lid from the pot and let the water from the mushrooms cook off a little. Add in the tomato paste, lentils and chopped tomato. Bring to a simmer. Add the sugar to balance out the flavors and add salt and pepper to taste.</li>
<li>Prepare your cashew cream. Add the cashews, lemon juice, water and salt to the blender jug and blend until smooth.</li>
<li>Add the cashew cream to your bolognese sauce and mix it in. Then add your pasta and mix it all in together.</li>
<li>Now prepare your white sauce. Add the vegan butter to a saucepan and let it melt and start to sizzle just a little. Add in the flour and stir it quickly, then add in the coconut milk and vegetable stock and whisk it very quickly to get rid of the lumps. Then switch to a wooden spoon and keep stirring while you bring it to the boil. Once it boils keep stirring for about another 4 minutes until thickened. Then remove from heat and add in the black pepper, dijon mustard, nutritional yeast and sea salt.</li>
<li>Preheat the oven to 220&deg;C.</li>
<li>Place the pasta and bolognese mix into a rectangular oven-safe dish and smooth down.</li>
<li>Pour the white sauce over the top and smooth down.</li>
<li>Bake uncovered for 20 minutes until golden on top.</li>
</ol>
</div>
</div>
</div>
</body>
</html>
